src/InformationRegisters/НастройкиАнализВызововКластера1С/НастройкиАнализВызововКластера1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиАнализВызововКластера1С</name>
  <resources>
    <name>КаталогТЖСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогТЖЛокальный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогВременныхФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьХраненияФайловТЖ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиУдалятьЗаписиТЖ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияТЖ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиАнализВызововКластера1С/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Функция ПрочитатьНастройки(КонтрольнаяПроцедура) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    МенеджерЗаписи.Прочитать();
    
    Настройки = Новый Структура;
    Настройки.Вставить("КаталогТЖСетевой", МенеджерЗаписи.КаталогТЖСетевой);
    Настройки.Вставить("КаталогТЖЛокальный", МенеджерЗаписи.КаталогТЖЛокальный);
    Настройки.Вставить("КаталогВременныхФайлов", МенеджерЗаписи.КаталогВременныхФайлов);
    Настройки.Вставить("ДлительностьХраненияФайловТЖ", МенеджерЗаписи.ДлительностьХраненияФайловТЖ);
    Настройки.Вставить("АвтоматическиУдалятьЗаписиТЖ", МенеджерЗаписи.АвтоматическиУдалятьЗаписиТЖ);
    Настройки.Вставить("СрокХраненияТЖ", МенеджерЗаписи.СрокХраненияТЖ);
    Настройки.Вставить("Расписание", МенеджерЗаписи.Расписание.Получить());
    
    Возврат Настройки;
    
КонецФункции

// Записать настройки
//
// Параметры:
//  КонтрольнаяПроцедура - СправочникСсылка.КонтрольныеПроцедуры - контрольная процедура, для которой записываются настройки.
//  Настройки            - Структура - структура создания с ключами:
//                                                            — ПороговаяПамять                    - Число(10,0), в мегабайтах.
//                                                            — СрокХраненияДанных                 - Число (10,0), часы.
//                                                            — АвтоматическиУдалятьЗаписиСеансов  - Булево.
//
Процедура ЗаписатьНастройки(КонтрольнаяПроцедура, Настройки) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    
    МенеджерЗаписи.Прочитать();
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    
    Если Настройки.Свойство("КаталогТЖСетевой") Тогда
        МенеджерЗаписи.КаталогТЖСетевой = Настройки.КаталогТЖСетевой;
    КонецЕсли;
    
    Если Настройки.Свойство("КаталогТЖЛокальный") Тогда
        МенеджерЗаписи.КаталогТЖЛокальный = Настройки.КаталогТЖЛокальный;
    КонецЕсли;
    
    Если Настройки.Свойство("КаталогВременныхФайлов") Тогда
        МенеджерЗаписи.КаталогВременныхФайлов = Настройки.КаталогВременныхФайлов;
    КонецЕсли;
    
    Если Настройки.Свойство("ДлительностьХраненияФайловТЖ") Тогда
        МенеджерЗаписи.ДлительностьХраненияФайловТЖ = Настройки.ДлительностьХраненияФайловТЖ;
    КонецЕсли;
    
    Если Настройки.Свойство("АвтоматическиУдалятьЗаписиТЖ") Тогда
        МенеджерЗаписи.АвтоматическиУдалятьЗаписиТЖ = Настройки.АвтоматическиУдалятьЗаписиТЖ;
    КонецЕсли;
    
    Если Настройки.Свойство("ДлительностьХраненияФайловТЖ") Тогда
        МенеджерЗаписи.СрокХраненияТЖ = Настройки.СрокХраненияТЖ;
    КонецЕсли;
    
    Если Настройки.Свойство("Расписание") Тогда
        МенеджерЗаписи.Расписание = Новый ХранилищеЗначения(Настройки.Расписание);
    КонецЕсли;
    
    МенеджерЗаписи.Записать(Истина);
    
КонецПроцедуры

Функция ДобавитьЗапись(КонтрольнаяПроцедура, КаталогТЖСетевой, КаталогТЖЛокальный, КаталогВременныхФайлов, ДлительностьХраненияФайловТЖ, АвтоматическиУдалятьЗаписиТЖ, СрокХраненияТЖ) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.НастройкиАнализВызововКластера1С.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
	МенеджерЗаписи.КаталогТЖСетевой = КаталогТЖСетевой;
	МенеджерЗаписи.КаталогТЖЛокальный = КаталогТЖЛокальный;
	МенеджерЗаписи.КаталогВременныхФайлов = КаталогВременныхФайлов;
	МенеджерЗаписи.ДлительностьХраненияФайловТЖ = ДлительностьХраненияФайловТЖ;
	МенеджерЗаписи.АвтоматическиУдалятьЗаписиТЖ = АвтоматическиУдалятьЗаписиТЖ;
	МенеджерЗаписи.СрокХраненияТЖ = СрокХраненияТЖ;
	
	МенеджерЗаписи.Записать();
    
КонецФункции

#КонецОбласти

#КонецЕсли
